## 1. Import and Setup

<a id="1s1"></a>
#### __`Step 1`__ Import libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.preprocessing import MinMaxScaler
from datetime import date

<a id="1s2"></a>
#### __`Step 2`__ Import CSV

In [2]:
df = pd.read_csv('cluster.csv')
df

,Churn,Name,Longevity,Year_Birth,TypeTravel,RoomType,RewardPoints,Comfort,ReceptionSchedule,FoodDrink,...,Wifi,Amenities,Staff,OnlineBooking,PriceQuality,RoomSpace,CheckOut,Checkin,Cleanliness,BarService
0,churn,Ms. Nicole Clarke,yes,1974.0,business,single,4907,3,4,1,...,4,3,4,3,3,3,3,4,3,4
1,nochurn,Mr. Jesse Scott,yes,1965.0,business,single,6724,1,1,1,...,5,3,4,5,5,5,5,1,5,2
2,churn,Mr. Christopher Carter,yes,1973.0,business,single,4365,3,3,3,...,1,4,4,3,3,2,3,2,3,1
3,nochurn,Ms. Jennifer Morgan,yes,1993.0,leisure,double,3849,1,1,1,...,4,4,5,4,4,4,4,4,4,3
4,nochurn,Mr. Michael White,yes,1989.0,business,single,5376,2,2,3,...,5,5,5,5,5,3,4,1,3,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
15584,churn,Ms. Wendy Roberts,no,1988.0,business,double,4968,2,0,2,...,3,2,4,3,4,5,1,3,4,3
15585,churn,Ms. Sonya Smith,no,2000.0,business,double,4970,3,3,3,...,5,3,5,5,3,1,3,4,4,5
15586,nochurn,Mr. Maxwell Wright,yes,1964.0,business,single,4046,1,1,1,...,3,4,5,4,4,4,4,5,4,4
15587,nochurn,Mr. Gregory Moran,yes,1992.0,leisure,double,5155,4,3,4,...,5,4,5,5,2,5,4,3,4,5
15588,churn,Mr. Steven Mendez,yes,1983.0,business,suite,5136,3,3,3,...,3,3,3,3,4,5,4,1,3,3

<a id="1s3"></a>
#### __`Step 3`__ Check for duplicates

In [3]:
df[df.duplicated()]

,Churn,Name,Longevity,Year_Birth,TypeTravel,RoomType,RewardPoints,Comfort,ReceptionSchedule,FoodDrink,...,Wifi,Amenities,Staff,OnlineBooking,PriceQuality,RoomSpace,CheckOut,Checkin,Cleanliness,BarService
8195,nochurn,Ms. Abigail York,yes,1995.0,leisure,double,5098,5,5,5,...,4,5,5,3,3,4,3,3,3,5
9176,churn,Ms. Abigail Kennedy,yes,1991.0,business,suite,5932,3,3,2,...,3,3,3,3,4,1,4,3,4,3
9417,nochurn,Ms. Abigail Buchanan,yes,1972.0,business,double,6769,5,4,4,...,5,5,4,5,5,5,5,2,5,1

In [4]:
df.drop_duplicates(inplace = True)

<a id="s4"></a>
#### __`Step 4`__ Set index

In [5]:
df.reset_index(inplace=True)
df.set_index('index',inplace = True)
df

,Churn,Name,Longevity,Year_Birth,TypeTravel,RoomType,RewardPoints,Comfort,ReceptionSchedule,FoodDrink,...,Wifi,Amenities,Staff,OnlineBooking,PriceQuality,RoomSpace,CheckOut,Checkin,Cleanliness,BarService
index,,,,,,,,,,,,,,,,,,,,,
0,churn,Ms. Nicole Clarke,yes,1974.0,business,single,4907,3,4,1,...,4,3,4,3,3,3,3,4,3,4
1,nochurn,Mr. Jesse Scott,yes,1965.0,business,single,6724,1,1,1,...,5,3,4,5,5,5,5,1,5,2
2,churn,Mr. Christopher Carter,yes,1973.0,business,single,4365,3,3,3,...,1,4,4,3,3,2,3,2,3,1
3,nochurn,Ms. Jennifer Morgan,yes,1993.0,leisure,double,3849,1,1,1,...,4,4,5,4,4,4,4,4,4,3
4,nochurn,Mr. Michael White,yes,1989.0,business,single,5376,2,2,3,...,5,5,5,5,5,3,4,1,3,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
15584,churn,Ms. Wendy Roberts,no,1988.0,business,double,4968,2,0,2,...,3,2,4,3,4,5,1,3,4,3
15585,churn,Ms. Sonya Smith,no,2000.0,business,double,4970,3,3,3,...,5,3,5,5,3,1,3,4,4,5
15586,nochurn,Mr. Maxwell Wright,yes,1964.0,business,single,4046,1,1,1,...,3,4,5,4,4,4,4,5,4,4
15587,nochurn,Mr. Gregory Moran,yes,1992.0,leisure,double,5155,4,3,4,...,5,4,5,5,2,5,4,3,4,5
15588,churn,Mr. Steven Mendez,yes,1983.0,business,suite,5136,3,3,3,...,3,3,3,3,4,5,4,1,3,3

## Exploration

<a id="2s1"></a>
#### __`Step 1`__ Basic exploration

In [6]:
df.shape

(15586, 21)

In [7]:
df.columns

Index(['Churn', 'Name', 'Longevity', 'Year_Birth', 'TypeTravel', 'RoomType',
       'RewardPoints', 'Comfort', 'ReceptionSchedule', 'FoodDrink', 'Location',
       'Wifi', 'Amenities', 'Staff', 'OnlineBooking', 'PriceQuality',
       'RoomSpace', 'CheckOut', 'Checkin', 'Cleanliness', 'BarService'],
      dtype='object')

In [8]:
df.head(5)

,Churn,Name,Longevity,Year_Birth,TypeTravel,RoomType,RewardPoints,Comfort,ReceptionSchedule,FoodDrink,...,Wifi,Amenities,Staff,OnlineBooking,PriceQuality,RoomSpace,CheckOut,Checkin,Cleanliness,BarService
index,,,,,,,,,,,,,,,,,,,,,
0,churn,Ms. Nicole Clarke,yes,1974.0,business,single,4907,3,4,1,...,4,3,4,3,3,3,3,4,3,4
1,nochurn,Mr. Jesse Scott,yes,1965.0,business,single,6724,1,1,1,...,5,3,4,5,5,5,5,1,5,2
2,churn,Mr. Christopher Carter,yes,1973.0,business,single,4365,3,3,3,...,1,4,4,3,3,2,3,2,3,1
3,nochurn,Ms. Jennifer Morgan,yes,1993.0,leisure,double,3849,1,1,1,...,4,4,5,4,4,4,4,4,4,3
4,nochurn,Mr. Michael White,yes,1989.0,business,single,5376,2,2,3,...,5,5,5,5,5,3,4,1,3,5

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 15586 entries, 0 to 15588
Data columns (total 21 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Churn              15586 non-null  object
 1   Name               15586 non-null  object
 2   Longevity          15586 non-null  object
 3   Year_Birth         15391 non-null  float64
 4   TypeTravel         15586 non-null  object
 5   RoomType           15586 non-null  object
 6   RewardPoints       15586 non-null  int64
 7   Comfort            15586 non-null  int64
 8   ReceptionSchedule  15586 non-null  int64
 9   FoodDrink          15586 non-null  int64
 10  Location           15586 non-null  int64
 11  Wifi               15586 non-null  int64
 12  Amenities          15586 non-null  int64
 13  Staff              15586 non-null  int64
 14  OnlineBooking      15586 non-null  int64
 15  PriceQuality       15586 non-null  int64
 16  RoomSpace          15586 non-null  int64
 17  CheckOut           15586 non-null  int64
 18  Checkin            15586 non-null  int64
 19  Cleanliness        15586 non-null  int64
 20  BarService         15586 non-null  int64
dtypes: float64(1), int64(15), object(5)
memory usage: 2.6+ MB

<a id="2s2"></a>
#### __`Step 2`__ Statistical exploration

**Numerical variables**

In [13]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Year_Birth,15391.0,1981.705607,15.179757,1936.0,1970.0,1981.0,1994.00,2014.0
RewardPoints,15586.0,5022.418581,1027.940126,409.0,4445.0,5088.0,5648.75,6950.0
Comfort,15586.0,2.841332,1.388541,0.0,2.0,3.0,4.00,5.0
ReceptionSchedule,15586.0,2.997049,1.519035,0.0,2.0,3.0,4.00,5.0
FoodDrink,15586.0,2.844412,1.436937,0.0,2.0,3.0,4.00,5.0
Location,15586.0,2.985821,1.299438,1.0,2.0,3.0,4.00,5.0
Wifi,15586.0,3.244963,1.327064,0.0,2.0,3.0,4.00,6.0
Amenities,15586.0,3.374631,1.352419,0.0,2.0,4.0,4.00,5.0
Staff,15586.0,3.506288,1.319625,1.0,3.0,4.0,5.00,5.0
OnlineBooking,15586.0,3.454190,1.310401,0.0,2.0,4.0,5.00,5.0
PriceQuality,15586.0,3.459579,1.268180,1.0,3.0,4.0,4.00,5.0
RoomSpace,15586.0,3.470871,1.293782,0.0,2.0,4.0,5.00,5.0
CheckOut,15586.0,3.700500,1.158693,1.0,3.0,4.0,5.00,5.0
Checkin,15586.0,3.327409,1.266944,1.0,3.0,3.0,4.00,5.0
Cleanliness,15586.0,3.692288,1.154484,1.0,3.0,4.0,5.00,5.0
BarService,15586.0,3.347427,1.300371,0.0,2.0,3.0,4.00,5.0

In [15]:
df.skew().T

C:\Users\ricar\AppData\Local\Temp/ipykernel_13372/1956230054.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.skew().T

Year_Birth          -0.003724
RewardPoints        -0.453744
Comfort             -0.100806
ReceptionSchedule   -0.260518
FoodDrink           -0.123543
Location            -0.050057
Wifi                -0.171105
Amenities           -0.599424
Staff               -0.554468
OnlineBooking       -0.472109
PriceQuality        -0.503290
RoomSpace           -0.482872
CheckOut            -0.750667
Checkin             -0.382822
Cleanliness         -0.745109
BarService          -0.358340
dtype: float64

In [18]:
df.describe(include = ['O']).T

            count unique                top   freq
Churn       15586      2            nochurn   8475
Name        15586  14227  Mr. Michael Smith      9
Longevity   15586      3                yes  12545
TypeTravel  15586      2           business  10754
RoomType    15586      3             single   7442

In [30]:
df['Churn'].value_counts()

nochurn    8475
churn      7111
Name: Churn, dtype: int64

In [27]:
df['Longevity'].value_counts()

yes    12545
no      2874
y        167
Name: Longevity, dtype: int64

In [28]:
df['TypeTravel'].value_counts()

business    10754
leisure      4832
Name: TypeTravel, dtype: int64

In [29]:
df['RoomType'].value_counts()

single    7442
double    7019
suite     1125
Name: RoomType, dtype: int64

**Quick transformations**

* Longevity: yes = 1, no = 0 <br>
* Churn: churn = 1, nochurn = 0 <br>
* TypeTravel: business = 1, leisure = 0 <br>

In [46]:
df['Longevity'] = df['Longevity'].replace({'y':1,'yes':1,'no':0})
df['Churn'] = df['Churn'].replace({'churn':1,'nochurn':0})
df['TypeTravel'] = df['TypeTravel'].replace({'business':1,'leisure':0})

In [45]:
df['Longevity'].value_counts()

1    12712
0     2874
Name: Longevity, dtype: int64

In [44]:
df['Churn'].value_counts()

1    8475
0    7111
Name: Churn, dtype: int64